{
    "code": "01D16004",
    "name": {
        "zh": "專一英文(一)",
        "en": "Fundamental English (I)"
    },
    "credit": "2",
    "type": "必修",
    "classes": [
        "五專化材一甲"
    ],
    "instructors": [
        "吳佩珊"
    ],
    "schedule": [
        {
            "day": "週四",
            "period": "第5節",
            "location": "I0305"
        },
        {
            "day": "週四",
            "period": "第6節",
            "location": "I0305"
        }
    ],
    "hours": {
        "course": "2",
        "practice": "0"
    },
    "languages": [
        "1.英語",
        "2.華語"
    ],
    "certificationsSupport": [
        "1.GEPT",
        "2.TOEIC"
    ],
    "description": "This course is designed to help students develop their listening and speaking skills in English, with a focus on basic daily conversation topics, including introducing people, talking about your daily life, ordering food in a restaurant, asking for travel information, and more. They will learn to identify and understand common vocabulary and expressions used in daily conversations, and gain familiarity with basic grammar structures and word pronunciation. Throughout the course, students will practice their listening skills by engaging with short dialogues on everyday topics. Additionally, students will practice their speaking skills by reading articles and expressing themselves in simple sentences.",
    "prerequisites": "",
    "syllabus": {
        "zh": "學生將在課程中強化基礎的英文聽講技巧，並學習如何:<br>1.\t詢問並給予個人資訊<br>2.\t開始一段對話<br>3.\t講述自己的日常行程<br>4.\t展現對某個領域的興趣<br>5.\t了解建議<br>6.\t了解旅遊資訊<br>7.\t講述自己的喜好與厭惡<br>8.\t描述並比較假期<br><br>學生也將在課程中學習以下的基礎文法知識:<br>1.\t現在簡單式<br>2.\t時間相關的介系詞<br>3.\t頻率副詞<br>4.\t所有格形容詞與所有格代名詞<br>5.\t祈使句<br>6.\t可數與不可數名詞<br>7.\t現在進行式<br>8.\t過去簡單式<br>",
        "en": "By the end of the course, students will have a solid foundation in English listening and speaking skills, and be able to:<br>1.\task for and give personal information<br>2.\tstart a conversation<br>3.\ttalk about daily schedule<br>4.\tshow interest<br>5.\tunderstand advice<br>6.\tunderstand travel information<br>7.\ttalk about likes and dislikes<br>8.\tdescribe and compare vacations<br><br>Students will showcase their command of the English language by mastering the following grammar concepts:<br>1.\tSimple present<br>2.\tPrepositions of Time<br>3.\tAdverbs of Frequency<br>4.\tPossessive Adjectives and Pronouns<br>5.\tImperatives<br>6.\tCount and Non-count Nouns<br>7.\tPresent Continuous<br>8.\tSimple Past<br>"
    },
    "weeklySchedule": "Week 1\tCourse introduction <br>Week 2\tU1 People<br>Week 3\tU1 People<br>Week 4\tU2 A Day in the Life + unit 1 quiz<br>Week 5\tU2 A Day in the Life<br>Week 6\tU3 Going Places     + unit 2 quiz<br>Week 7\tU3 Going Places<br>Week 8\tMidterm Oral Report + Units review<br>Week 9\tMidterm Exam<br>Week 10\tDiscussion on midterm exam<br>Week 11\tU4 Food<br>Week 12\tU4 Food<br>Week 13\tU5 Sports         + unit 4 quiz<br>Week 14\tU5 Sports<br>Week 15\tU6 Destinations   + unit 5 quiz<br>Week 16\tU6 Destinations<br>Week 17\tFinal exam / Oral Presentations<br>Week 18\tFinal Exam / Writing exam<br>",
    "exams": {
        "midterm": "writing test + listening test",
        "final": "writing test +  oral test",
        "other": "quiz"
    },
    "teachingAndAssessment": [
        {
            "objective": "Discussion / learning topics from different disciplines, and moral themes related to modern society.",
            "teachingMethods": [
                "啟發思考",
                "課堂講授"
            ],
            "assessmentMethods": [
                {
                    "method": "自我評量",
                    "type": "平時"
                },
                {
                    "method": "筆試",
                    "type": "期中"
                }
            ]
        },
        {
            "objective": "Students will communicate orally with one another in a relaxed environment.",
            "teachingMethods": [
                "分組討論"
            ],
            "assessmentMethods": [
                {
                    "method": "日常表現",
                    "type": "平時"
                }
            ]
        },
        {
            "objective": "Students will learn to communicate orally in English and to convey messages to both their teacher and their classmates.",
            "teachingMethods": [
                "分組討論",
                "成果驗收"
            ],
            "assessmentMethods": [
                {
                    "method": "口試",
                    "type": "期末"
                },
                {
                    "method": "日常表現",
                    "type": "平時"
                }
            ]
        },
        {
            "objective": "Students will learn how to integrate with others via oral communication.",
            "teachingMethods": [
                "分組討論"
            ],
            "assessmentMethods": [
                {
                    "method": "口頭報告",
                    "type": "平時"
                }
            ]
        }
    ],
    "textbook": {
        "title": "World English 1: Real People, Real Places, Real Languages. 3rd Edition. National Geographic Learning",
        "author": "John Hughes and Martin Milner. 2020.",
        "publisher": "Crane Publishing文鶴出版社",
        "year": "2020",
        "ISBN": "978-0-357-13020-9",
        "edition": "1st"
    },
    "referenceBooks": "1.\t語言中心編寫「英文基礎能力強化手冊」，請自行下載學習 (於教材區)<br>2.\t英語閱讀理解訓練範圍，每年級各6篇，請以學號登入google之後，連結下列網頁自行做線上練習",
    "teachingSoftware": "PPT/On-line resource/English-learning App/",
    "rules": "課程評分方式: <br>1.Attendance and Participation: 10%<br>2.Comprehension test: 10%<br>3.Oral Presentations: 20%<br>4.Midterm Exam: 30%<br>5. Final Exam: 30%                           <br>"
}