{
    "code": "1LD07301",
    "name": {
        "zh": "歐洲概論",
        "en": "An Introduction to Europe"
    },
    "credit": "3",
    "type": "自選必修",
    "classes": [
        "人文藝術領域"
    ],
    "instructors": [
        "方子毓"
    ],
    "schedule": [
        {
            "day": "週五",
            "period": "第4節",
            "location": "T0001"
        },
        {
            "day": "週五",
            "period": "第5節",
            "location": "T0001"
        },
        {
            "day": "週五",
            "period": "第6節",
            "location": "T0001"
        }
    ],
    "hours": {
        "course": "3",
        "practice": "0"
    },
    "languages": [
        "1.華語",
        "2.英語"
    ],
    "certificationsSupport": [
        "無"
    ],
    "description": "本課程以認識歐洲文化為主軸，將著重「歐陸」國家，尤其位處中歐與西歐的德國和法國，將分三個階段討論歐洲文化的發展：首先， 透過文藝復興、工業革命、啟蒙運動等論題，以了解近代歐洲歷史發展的背景；其次，透過歐洲文學、音樂、藝術、醫學與科學等，尤重文學作品中所呈現的歐洲居民生活與思維，討論 19世紀至20世紀歐洲文化如何因著殖民與貿易的發展，對歐洲以外的世界產生的衝擊與影響；最後透過歐洲聯盟(EU)的功能與組織運作，理解當代歐洲統合的過程及未來的走向。<br>在教學方式上，本課程將以影音、圖像為媒材，透過歐洲文化相關議題設計，鼓勵學生主動挖掘問題，並從討論中發現歐洲、理解歐洲歷史並主動關注歐洲現況的發展。期達成以下目標：<br>1.\t學生概略理解歐洲歷史、語言、文化、政治、外交及生活型態等議題;<br>2.\t學生藉課程學習加強對歐洲文化的認識，培養更深刻的國際觀;<br>3.\t學生認識歐洲文化後，學生主動探索、關注當代歐洲各類議題;<br>4.\t學生透過歐洲相關議題設計拓展視野，並能在學期報告中以口語表達呈現。<br>",
    "prerequisites": "",
    "syllabus": {
        "zh": "本課程共分為八個主要單元來進行，分別為：<br>1. 導論：認識歐洲<br>2. 歐洲近代史<br>3. 工業革命後之歐洲社會<br>4. 歐洲區域研究專題探討<br>5. 地緣上的歐洲<br>6. 歐洲統合史專題<br>7. 當代歐洲文化探討<br>8.台灣與歐洲。<br>",
        "en": "This course will focus on the culture of Europe, especially that of \"continental\" countries, Germany and France inclusive. This course will discuss the development of European culture by three steps. Firstly, it will focus on the periods of Renaissance, Industrial Revolution and Enlightenment to explore the background of history of modern Europe .Further more, this course will focus on the developments of music, art, medicine and science of Europe in19th century and 20th century, particularly the life and thinking way of European people revealed in the literary works, to explore the impacts of European culture upon the outside world through colonization and trade. Lastly, it will lead students to understand the process and trend of contemporary European integration through the organization, operation and function of European Union. The topics of this course will be as follows:<br>1.\tAn overview of Europe,<br>2.\tModern European History, <br>3.\tIndustrial Revolution, <br>4.\tRegional Studies in Europe, <br>5.\tGeopolitical and strategical statuses of Europe in the world,<br>6.\tIntegration of Europe through EU ,<br>7.\tCulture of contemporary Europe, <br>8.\tRelationship between Taiwan and Europe.<br>"
    },
    "weeklySchedule": "1導論：認識歐洲 課程簡介--何謂歐洲文化？從其歷史背景撰述。<br>2歐洲近代史（一）文藝復興後的歐洲社會與文化：從宗教神學至人文思想的轉變，瞭解文藝復興的真諦。<br>3歐洲近代史（二）以宗教改革、大航海時代的來臨、世界史的發展、科學革命與啟蒙時代瞭解歐洲近代史重點。<br>4工業革命後之歐洲社會工業革命與十九世紀後的歐洲—歐洲科學與文化如何逐漸影響世界？<br>5大國崛起之系列探討（一）葡萄牙、西班牙、荷蘭—可搭配視聽教材《大國崛起(一)》西班牙、葡萄牙，《大國崛起(二)》荷蘭，做課程教學與討論。<br>6大國崛起之系列探討（二）英國、法國、德國、義大利、俄羅斯等可搭配視聽教材《大國崛起》或國別史專書進行<br>7歐洲區域研究專題探討（一）西歐、北歐文明的發展—歷史、生活與文化面介紹。西歐海洋文明及北歐斯堪地那半島文化介紹，並讓學生在歐洲的區域上有概略上的認知。<br>※預計將於第6週~8週之間安排一次專家講座，將視情況而定。<br>8歐洲區域研究專題探討（二）中歐、東歐文明的發展—1.德國、奧地利、瑞士等德語系國家介紹，可以專史書籍、自身經驗與學生座課堂分享。2.東歐國家歷史文化介紹。<br>9期中考試週\t筆 試<br>10視聽教學歐洲文學、藝術等影片欣賞與討論--從電影教學來認識歐洲，例如：《羅馬假期》(Roman Holiday)，介紹1950年代義大利羅馬市景、劇情：探討人性光輝、誠信、樂觀與愛情價值等。<br>11地緣上的歐洲「歐陸」文明與「海洋」文明-地緣上的歐洲，-歐洲疆界探討，及其與周邊國家之互動關係，以時事問題來導入，地緣上所涵蓋的歐洲文化領域是否包括：西亞、地中海與北非？<br>12歐洲統合史專題（一）\t從煤鋼共同體（ECSC）到歐洲共同市場（冷戰時期之歐洲）--二次大戰後之歐洲歷史與文化，當代歐洲發展史導讀，讓學生認識歐洲統合史。<br>13歐洲統合史專題（二）\t從歐洲共同體（EC）到歐洲聯盟（EU）--論歐洲當前局勢與未來，並以時事分析討論歐洲當代議題。<br>※預計將於第11週~13週之間安排一次校外參訪，將視情況而定。<br>14當代歐洲文化探討二十世紀歐洲文化的發展，及其對世界之影響。<br>歐洲文明之：政治、經濟、產業、藝術與文化。--陸續以學期報告方式進行。<br>15臺灣與歐洲認識臺灣與歐洲國家間之經貿與外交—以「台灣與世界」的角度來看歐洲文化及其外來之互動與發展--陸續以學期報告方式進行。<br>16報告與討論歐洲文化之課程回顧與展望，期末報告心得分享。<br>17成果報告與討論分組進行期末學習成果報告，評量、討論與分享—期末報告上傳或繳交<br>18.期末考週",
    "exams": {
        "midterm": "筆試",
        "final": "期末分組報告與心得繳交",
        "other": "平時作業、課堂回饋單等"
    },
    "teachingAndAssessment": [
        {
            "objective": "讓學生概略理解歐洲歷史、語言、文化、政治、外交及生活型態等議題。",
            "teachingMethods": [
                "課堂講授"
            ],
            "assessmentMethods": [
                {
                    "method": "作業",
                    "type": "平時"
                }
            ]
        },
        {
            "objective": "學生藉由課程學習強對歐洲文化的認識，進而培養更深刻的國際觀。",
            "teachingMethods": [
                "專題演講",
                "參觀實習"
            ],
            "assessmentMethods": [
                {
                    "method": "作業",
                    "type": "平時"
                }
            ]
        },
        {
            "objective": "學生認識歐洲文化後，主動探索、關注當代歐洲各類議題。",
            "teachingMethods": [
                "課堂講授",
                "啟發思考"
            ],
            "assessmentMethods": [
                {
                    "method": "筆試",
                    "type": "期中"
                }
            ]
        },
        {
            "objective": "學生自行尋找歐洲文化各類主題，從中瞭解並拓展視野，在學期報告中以口語表達呈現。",
            "teachingMethods": [
                "課堂講授",
                "分組討論",
                "啟發思考"
            ],
            "assessmentMethods": [
                {
                    "method": "書面報告",
                    "type": "期末"
                }
            ]
        }
    ],
    "textbook": {
        "title": "歐洲概論",
        "author": "方子毓",
        "publisher": "五南圖書公司",
        "year": "2018",
        "ISBN": "978-957-11-9509-4",
        "edition": "一版一刷"
    },
    "referenceBooks": "1.\t《歐洲人歐洲風》，Peter Collett原著，徐健譯，台北：方智出版社，1995年2月。ISBN：957-679-253-3。<br>2.\t《歐洲聯盟簡史》，Philip Thody原著，鄭棨元譯，台北：三民書局，2001年1月。ISBN：957-143-401-9。<br>3.\t《西洋近代史》，王曾才著，台北：正中書局，2000年5月，臺三版。ISBN：957-09-0214-0。 <br>4.\t《歐洲人談歐洲—十九與二十世紀歐洲自我意識的形成》，哈爾特穆特‧凱爾伯樂原著，柯燕珠譯，周全審定，台北：左岸文化，2005年10月。ISBN：986-7174-07-0。<br>5.\t《製作路易十四》，彼得‧柏克( Peter Burke)原著，許綏南譯，台北：麥田出版，2005年6月1日二版一刷。ISBN：986-725-234-9。<br>6.\t《知識社會史-從古騰堡到狄德羅》，彼得‧柏克(Peter Burke)原著，賈士蘅譯，台北：麥田出版，2003年1月，二版一刷。ISBN：986-7782-63-1。<br>7.\t《邁向歐洲聯盟之路》，張福昌著，台北：三民，2002年1月。ISBN：957-143-469-8。<br>8.\t《前進福爾摩沙-十七世紀大航海時代的台灣》，湯錦台著，台北：貓頭鷹出版社，2001年2月。ISBN：957-469-342-2。<br>9.\t《西洋繪畫史》，馮作民著，台北：藝術圖書公司，1999年元月。ISBN：957-904-587-9。<br>10.\t《福爾摩沙的西洋建築想像》，楊啟正、凌宗魁合著，台北：玉山社，2018年8月。ISBN：987-986-294-206-2。<br>11.\t《歐洲聯盟史》，鄒忠科、沈娟娟、蔡裕鎮合著，台北：五南，2011年1月。 ISBN：978-957-116-153-2。<br>12.\t《愛的教育》，Edmondo De Amicis原著，儲蕾譯，台北：書泉，2007年12月。 ISBN：978-986-121-346-0。<br>13.《大國崛起》(DVD)，1～12集，台北：沙鷗國際，局錄劇字第018665號。<br>14.《羅馬假期》(Roman Holiday)(DVD)，新北市：影久有限公司。<br><br>",
    "teachingSoftware": "教室電腦設備系統 教學PPT等運用",
    "rules": "1.本課程鼓勵學生主動提問討論，以激發學生對歐洲歷史與文化之興趣。<br>2.課程要求：期末書面報告、期中筆試、平時成績（課程參與程度、作業心得等）。<br>3.學期評量：<br>(1)配分：期中考30％、期末考30％、平時成績40％。<br>(2)課堂作業、學習單、學習心得或測驗等將按次計算成績。<br>(3)平時表現所佔比重高，出席率與上課互動列為評量重要依據，尤重上課態度，若點名曠課節數達18節，平時成績以0分計。選上而不到課、修課之同學，請考慮退選將機會讓出。<br>4.本課程期末書面報告之繳交，各學科領域之修課學生可自行選擇作業主題，如工業科技、觀光餐飲、文學藝術、歷史文明等皆可嘗試，以達自主學習歐洲各項文化與產業特色之目的。<br>5.本課程預計申請創新教學計畫，學期過程中將有一次校外參訪及專家演講。（校外參訪無故不到曠課以3節計）<br>6.上課嚴格要求禁止穿拖鞋進教室。<br>7.疫情期間依照規定嚴守防疫規定(戴口罩等)<br>"
}